[
  {
    "id": "251e22b5-3f51-4e61-9593-a27f5b1e9584",
    "created_time": "2023-03-10T20:36:00.000Z",
    "last_edited_time": "2023-03-16T21:44:00.000Z",
    "text": "can words change the world? words don’t produce tangible change on their own. words are not actions. but words can ignite action"
  },
  {
    "id": "24eb9d21-7bf1-4e17-b728-9c8494e8f649",
    "created_time": "2023-03-12T01:22:00.000Z",
    "last_edited_time": "2023-03-12T14:23:00.000Z",
    "text": "social relationships are way too difficult i love computers"
  },
  {
    "id": "52f0fb8f-62c8-4b19-87cc-722967d8dcf5",
    "created_time": "2023-03-12T19:53:00.000Z",
    "last_edited_time": "2023-03-12T19:53:00.000Z",
    "text": "there’s a fine line between minimalism and laziness"
  },
  {
    "id": "e0e6d19e-c5e3-4cd7-ab7f-1b01368cde61",
    "created_time": "2023-03-16T21:41:00.000Z",
    "last_edited_time": "2023-03-16T21:43:00.000Z",
    "text": "i predict a resurgence of trade jobs in the next decade. manual, hands-on physical labor will be at a premium"
  },
  {
    "id": "c595ded7-a788-44ef-a032-c124d33bf392",
    "created_time": "2023-03-17T13:38:00.000Z",
    "last_edited_time": "2023-05-24T13:41:00.000Z",
    "text": "logical evolution for GPT based tools is not requiring active input. too much friction to write a good prompt. track my digital activity, derive what I want/need, write optimized prompts for me"
  },
  {
    "id": "2d94972c-f5e3-42ef-b2c5-160297347751",
    "created_time": "2023-03-17T23:54:00.000Z",
    "last_edited_time": "2023-03-17T23:59:00.000Z",
    "text": "steep learning curve is an euphemism for bad software"
  },
  {
    "id": "3f3a2c37-28cb-4419-b4ef-fae524eb8303",
    "created_time": "2023-03-18T12:56:00.000Z",
    "last_edited_time": "2023-03-18T22:35:00.000Z",
    "text": "trying to be more intentional on defining my social environment. people surrounding you can really impact your identity, shape the way you think & act - for the good & bad. important to be mindful  "
  },
  {
    "id": "a0855a5c-94e0-440a-a9e1-825ae5a2a077",
    "created_time": "2023-03-18T13:04:00.000Z",
    "last_edited_time": "2023-04-02T17:26:00.000Z",
    "text": "feel most modern JS frameworks are too obsessed & over-engineering rendering patterns. extracting every second of performance on page load & interactivity is not what the user ultimately wants. sure, gotta keep it fast – but let’s avoid perf tunnel vision"
  },
  {
    "id": "2d438014-fc21-493f-b68b-fb0b0ed5767c",
    "created_time": "2023-03-19T12:48:00.000Z",
    "last_edited_time": "2023-05-17T22:22:00.000Z",
    "text": "the world would be a better a place if we all built great APIs. oddly satisfying to use a predictable, consistent & intuitive API, with great data structures, naming convention aesthetics and high-level abstractions"
  },
  {
    "id": "609a6f3f-98bc-4a1a-84fe-19b225fc1a6f",
    "created_time": "2023-03-19T13:32:00.000Z",
    "last_edited_time": "2023-03-19T17:48:00.000Z",
    "text": "you officially enter adulthood when your actions reflect your ephemeral condition"
  },
  {
    "id": "533dfc3e-b72b-4b6b-b91d-f850dc551e47",
    "created_time": "2023-03-19T17:48:00.000Z",
    "last_edited_time": "2023-03-21T13:11:00.000Z",
    "text": "internally i still take pride in being overworked – that should change. i try too hard, too much. i should focus on doing high value work instead"
  },
  {
    "id": "e46d7109-9715-4fb7-8082-d305f58aaa0b",
    "created_time": "2023-03-19T17:48:00.000Z",
    "last_edited_time": "2023-03-22T01:17:00.000Z",
    "text": "we’re overestimating LLMs autonomy. input is needed. you need humans to ask the right questions "
  },
  {
    "id": "b017ca04-2942-4149-896c-b39f3800c710",
    "created_time": "2023-03-22T00:42:00.000Z",
    "last_edited_time": "2023-03-22T01:20:00.000Z",
    "text": "wish the web would come around to its roots. no big platforms, no aggregators. just everyone with their own little digital home. a world connected by hyperlinks"
  },
  {
    "id": "f4f4f774-54f0-41a1-8fe2-cf8a20c1a227",
    "created_time": "2023-03-24T14:04:00.000Z",
    "last_edited_time": "2023-04-20T12:44:00.000Z",
    "text": "we take pride in doing something complex because it’s hard to justify the perceived effort of doing something simple. simple is often seen as lazy"
  },
  {
    "id": "39cbfc76-c5a3-4823-958c-ca63c1d52dba",
    "created_time": "2023-03-24T14:10:00.000Z",
    "last_edited_time": "2023-03-24T18:50:00.000Z",
    "text": "multi-line editing should be an ubiquitous feature on text editors. and unfortunately it’s not"
  },
  {
    "id": "d892af90-1de6-45fb-9d0b-01980917f469",
    "created_time": "2023-03-24T18:49:00.000Z",
    "last_edited_time": "2023-05-17T22:21:00.000Z",
    "text": "when mouse gets cold it means 2 things: i’m using good software & i’m doing computers right"
  },
  {
    "id": "ee89e804-8922-42a2-b939-86bb83ba2f7c",
    "created_time": "2023-03-24T20:45:00.000Z",
    "last_edited_time": "2023-05-15T23:42:00.000Z",
    "text": "i feel minorities (ethnic, gender) often sabotage their inclusion in society. self-segregation happens a lot – mostly in the form of events for minority members only. there’s an implicit “us” vs “them” feeling – if you’re not one of us, you don’t understand, you don’t belong. this ends up being harmful for the minority, which gets increasingly excluded; and society, which gets decreasingly diverse"
  },
  {
    "id": "157c0f53-9404-43f1-b581-a704801c2f04",
    "created_time": "2023-03-26T02:19:00.000Z",
    "last_edited_time": "2023-04-20T12:45:00.000Z",
    "text": "i used to think i preferred computers to humans. now i think i haven’t met the right humans yet"
  },
  {
    "id": "85833a00-942c-4029-9941-d54f6a699223",
    "created_time": "2023-03-26T02:23:00.000Z",
    "last_edited_time": "2023-05-17T22:20:00.000Z",
    "text": "photorealistic image generation means: no more endless scrolling on stock images; no more copyright issues; just pure AI magic"
  },
  {
    "id": "8bb501f3-2aa8-40b4-ab89-40159ffac323",
    "created_time": "2023-03-27T15:52:00.000Z",
    "last_edited_time": "2023-04-02T17:28:00.000Z",
    "text": "knowledge is really not about knowing how to do something – but knowing something can be done"
  },
  {
    "id": "a4bad5f1-864f-4d40-ac7a-4aeeb1f562e0",
    "created_time": "2023-03-28T12:34:00.000Z",
    "last_edited_time": "2023-03-29T13:31:00.000Z",
    "text": "watching flowers bloom reminds me how progress can be seemingly invisible. you never actually see the petals opening. but it compounds over time. eventually the small increments become something tangible"
  },
  {
    "id": "9a6942dc-644a-407e-a548-b38192cac351",
    "created_time": "2023-03-29T18:18:00.000Z",
    "last_edited_time": "2023-04-02T17:30:00.000Z",
    "text": "i keep on not understanding why clothes i’m wearing have such an impact on my mood"
  },
  {
    "id": "07c19183-cb85-4528-9ad4-6c4cf9552fcc",
    "created_time": "2023-04-02T16:22:00.000Z",
    "last_edited_time": "2023-04-02T17:11:00.000Z",
    "text": "i see the benefit in typed languages, but typescript is not worth it. consistent naming patterns & structures win over adding another compilation step to your code"
  },
  {
    "id": "c786bda9-a012-4855-a942-758eddb4f66a",
    "created_time": "2023-04-02T16:58:00.000Z",
    "last_edited_time": "2023-04-02T17:23:00.000Z",
    "text": "spectrums instead of absolutes. we tend to categorize people & things in absolute terms – this person is x, this thing is y. in reality, nothing in life can be defined so simplistically. we are all spectrums – of thoughts, opinions, ideas – and things are a reflection of it"
  },
  {
    "id": "b0a76fa2-195e-4a50-8963-8399a255334d",
    "created_time": "2023-04-04T22:53:00.000Z",
    "last_edited_time": "2023-04-04T22:56:00.000Z",
    "text": "awareness is the ultimate life superpower. practicing internal & external mindfulness is the way to get it"
  },
  {
    "id": "377fd4f5-c3b4-4cad-a686-6b9da8b5d4a3",
    "created_time": "2023-04-07T10:30:00.000Z",
    "last_edited_time": "2023-04-07T10:35:00.000Z",
    "text": "you realize how much data you give away when every company in the whole world sends you a birthday message"
  },
  {
    "id": "d24a4c98-48b0-4ca0-b316-88cdf877bac2",
    "created_time": "2023-04-07T17:20:00.000Z",
    "last_edited_time": "2023-04-08T04:35:00.000Z",
    "text": "i die a little inside every time someone says you should use tools you’re comfortable with. you stagnate when you’re comfortable. doing things a different way, using different tools, is where growth happens"
  },
  {
    "id": "4bb2115d-b8d5-4a39-9821-df20b35c4b47",
    "created_time": "2023-04-09T10:51:00.000Z",
    "last_edited_time": "2023-04-21T19:49:00.000Z",
    "text": "spreadsheets are just great. modeling data through rows and columns – you rarely need anything more than that. flat structures. ubiquitous usage. small to medium scale, a spreadsheet is all you need"
  },
  {
    "id": "9affae24-9eae-45b0-9174-3f9fa23e40ac",
    "created_time": "2023-04-09T16:10:00.000Z",
    "last_edited_time": "2023-04-09T16:16:00.000Z",
    "text": "single metrics are very attractive. but eventually fall short of an accurate representation of reality. they don’t account for all the variables. they don’t account for the complexity of a decision"
  },
  {
    "id": "705442c1-8cfd-4f5c-8192-74fbc9ea6b15",
    "created_time": "2023-04-09T17:27:00.000Z",
    "last_edited_time": "2023-04-11T22:13:00.000Z",
    "text": "reminding myself to ask more questions. both at work & life. really hard on your ego, because you’ll ask some really stupid ones. but no questions mean no answers."
  },
  {
    "id": "b64848c6-ce92-454e-a2ef-958919c9e81b",
    "created_time": "2023-04-11T22:13:00.000Z",
    "last_edited_time": "2023-04-13T20:35:00.000Z",
    "text": "often i find it hard to believe someone finds me attractive. i think it’s much easier for men. you can be attractive in a lot of different ways since you’re not so sexually objectified by society. unfortunately women suffer a lot from that"
  },
  {
    "id": "9814b255-73b7-4ffd-b609-0693a7707622",
    "created_time": "2023-04-13T20:35:00.000Z",
    "last_edited_time": "2023-04-16T08:42:00.000Z",
    "text": "coupling and decoupling are the ying and yang of software. couple things for maintainability, but beware of side effects. decouple things for flexibility, but beware of repetition"
  },
  {
    "id": "66d8738f-7d0a-4766-a05b-724896815f34",
    "created_time": "2023-04-16T19:07:00.000Z",
    "last_edited_time": "2023-04-20T12:44:00.000Z",
    "text": "there’s an increasing transient nature to digital text. most social platforms encourage sharing text that lives for a short period of time, before disappearing forever. it all started with Snapchat, then Instagram Stories and recently BeReal. not sure how i feel about this – are we losing precious digital memories?"
  },
  {
    "id": "be242224-ec74-40d0-a984-216b2cc2f227",
    "created_time": "2023-04-17T17:08:00.000Z",
    "last_edited_time": "2023-04-17T23:59:00.000Z",
    "text": "copy/duplication actions should discouraged in software. too many users creating infinite sources of truth. keeping every instance in sync is a nightmare. hurts the software, hurts the user"
  },
  {
    "id": "25c47333-185b-4584-bc6f-2301895769f2",
    "created_time": "2023-04-18T00:00:00.000Z",
    "last_edited_time": "2023-04-18T00:01:00.000Z",
    "text": "memories and emotions are so interconnected. experience something vividly – remember it forever"
  },
  {
    "id": "f1b096a4-1b58-4904-b62f-f81e6c9951fd",
    "created_time": "2023-04-19T20:55:00.000Z",
    "last_edited_time": "2023-05-24T13:43:00.000Z",
    "text": "i am quite sensitive to smell – and nothing beats new car smell"
  },
  {
    "id": "d8c7801a-bc8d-4b9b-bbe7-6b70029bcde9",
    "created_time": "2023-04-20T12:15:00.000Z",
    "last_edited_time": "2023-04-20T12:20:00.000Z",
    "text": "eagerly awaiting the day where we drop native apps for progressive web apps"
  },
  {
    "id": "319cf205-838c-4bd7-aaed-fb1e12963801",
    "created_time": "2023-04-20T12:20:00.000Z",
    "last_edited_time": "2023-04-20T12:34:00.000Z",
    "text": "the web is the best platform for software: ubiquitous, secure, public. not coupled to a specific OS, not controlled by a single company. search, link, share everywhere. compatible with any device. single codebase. it’s perfect"
  },
  {
    "id": "e9c9b7a2-0b69-43ce-8e80-0e061b545da8",
    "created_time": "2023-04-20T19:13:00.000Z",
    "last_edited_time": "2023-05-24T13:43:00.000Z",
    "text": "hard to accept, but a lot of what we believe is placebo. dogmas, rules & ways of living that don't really prove themselves; but don’t hurt either. believing in them isn’t always bad – ease of mind based on false beliefs is ok. but I believe this derives from a societal disease of not practicing scientific skepticism – trying to prove things wrong rather than right; questioning everything; being curious"
  },
  {
    "id": "0f6afcaa-70e1-445c-ad71-e542bbb5b374",
    "created_time": "2023-04-21T16:45:00.000Z",
    "last_edited_time": "2023-04-21T16:52:00.000Z",
    "text": "like we have password managers, we will have prompt managers. store your prompts in a secure, private place. ready to reuse on multiple environments. integrate with browsers, sync between devices. never remember a prompt again – just bring it in from a prompt manager"
  },
  {
    "id": "30a8e869-dded-46ac-bf26-b7c666199fb6",
    "created_time": "2023-04-21T19:47:00.000Z",
    "last_edited_time": "2023-04-21T20:06:00.000Z",
    "text": "my favorite character is ampersand. &. simple yet beautiful"
  },
  {
    "id": "64058467-3aa8-4ddb-ac61-d05621348fcd",
    "created_time": "2023-04-21T20:33:00.000Z",
    "last_edited_time": "2023-04-22T20:12:00.000Z",
    "text": "existential: nothing in life was created by you. not even yourself. we’re merely iterating on our past: everything we do is a product of our influences. ideas, thoughts we’ve been exposed to. but we have the power to build upon them and create something new"
  },
  {
    "id": "5a0d83a1-bc34-4da1-b1e6-857f9f9a4bc9",
    "created_time": "2023-04-22T20:12:00.000Z",
    "last_edited_time": "2023-04-22T20:21:00.000Z",
    "text": "very few platforms support unstructured writing. that sucks. our thoughts are unstructured by nature. why should our words be different? imposing writing patterns & rules is ok for final product, but i feel many incredible streams of consciousness are being wasted on artificial limitations"
  },
  {
    "id": "b8ce6e70-7959-41b9-a849-f26c00c56fe7",
    "created_time": "2023-04-22T20:22:00.000Z",
    "last_edited_time": "2023-04-22T20:33:00.000Z",
    "text": "transitioning from Windows to MacOS: command feels more ergonomic than control. slight movement of thumb vs hard reach with pinky. it’s definitely different"
  },
  {
    "id": "2d70152f-ec97-4534-ae9e-d0dc992090d0",
    "created_time": "2023-04-23T15:43:00.000Z",
    "last_edited_time": "2023-04-23T15:51:00.000Z",
    "text": "websites not accepting non-ASCII characters on name fields: it hurts my feelings not being able to enter my own name on a sign-up flow. i love my cedilla"
  },
  {
    "id": "5003599d-7164-4992-966c-22eba0b03f91",
    "created_time": "2023-04-25T18:19:00.000Z",
    "last_edited_time": "2023-04-25T18:31:00.000Z",
    "text": "intentionally avoiding structured learning (courses/tutorials) has been extremely helpful for me to learn things faster. usually, i now follow these steps: get a high level view on the subject to understand core concepts & ideas; see practical examples to understand applicability; create my own thing, asking questions along the process"
  },
  {
    "id": "aa9a62b8-b328-46b1-bab1-046d10dc2647",
    "created_time": "2023-04-27T12:15:00.000Z",
    "last_edited_time": "2023-04-27T15:54:00.000Z",
    "text": "i’m extremely uncomfortable with abstractions i’m unable to dissect. if i don’t understand how something works, i lose sense of control. like i’m building on top of shaky, fragile knowledge. this always ends up making me lose too much time: either by trying too hard to grasp an existing abstraction; or trying to hard to create my own abstraction"
  },
  {
    "id": "6b010693-768e-45e3-a3ed-53be4c7be254",
    "created_time": "2023-04-27T12:21:00.000Z",
    "last_edited_time": "2023-04-27T12:21:00.000Z",
    "text": "everytime you do the same thing, it’s a missed opportunity to do something different"
  },
  {
    "id": "fc68bb1f-7b24-441f-b5bf-8cfa80c4c302",
    "created_time": "2023-04-28T09:32:00.000Z",
    "last_edited_time": "2023-04-28T09:40:00.000Z",
    "text": "having a positive mindset towards something (a task, activity, project) is half the battle won already. If you believe you will do it well, you most often do"
  },
  {
    "id": "879317f8-9366-4317-a976-08cf2fae167e",
    "created_time": "2023-04-28T18:16:00.000Z",
    "last_edited_time": "2023-04-28T20:47:00.000Z",
    "text": "gotta love a “nice touch”. features that are definitely not needed, but someone goes the extra mile to make them happen. really makes a product/service shine"
  },
  {
    "id": "026872f3-5645-47a8-821e-17c4270a4085",
    "created_time": "2023-04-30T11:58:00.000Z",
    "last_edited_time": "2023-04-30T12:12:00.000Z",
    "text": "hover interactions are not a viable option for the web anymore. most users (>50%) are coming from mobile today. intersection observers are a great way to trigger a hover state, without a hover interaction – make an element stand out if it is currently displayed on the viewport"
  },
  {
    "id": "ca2fcee5-098d-4ac2-8f8f-904797ac8e2b",
    "created_time": "2023-05-02T15:10:00.000Z",
    "last_edited_time": "2023-05-02T15:21:00.000Z",
    "text": "to build a resilient & flexible system, you need iteration. it’s inevitable. a system can only prove its value when exposed to multiple different contexts. if it fails to adapt to a new context, it’s not a great system yet. as you iterate on multiple contexts, the system will progressively adapt to cover more edge cases, and patterns will start to emerge naturally. this takes time, effort and refactoring – you have to put in the work & not be afraid to break things in the process"
  },
  {
    "id": "ffe1e5ec-9418-4fd3-903a-7f42b56126a7",
    "created_time": "2023-05-03T15:03:00.000Z",
    "last_edited_time": "2023-05-03T15:04:00.000Z",
    "text": "there’s nothing like the smell of rain after a long, dry spell. so pleasant"
  },
  {
    "id": "6edc1d54-2d5c-4ff2-96bc-3fbfd797a11c",
    "created_time": "2023-05-05T12:55:00.000Z",
    "last_edited_time": "2023-05-07T10:35:00.000Z",
    "text": "i want more input but need more output"
  },
  {
    "id": "e0e7f5d0-e03e-41af-a8eb-7c903b0ed353",
    "created_time": "2023-05-07T15:10:00.000Z",
    "last_edited_time": "2023-05-14T17:03:00.000Z",
    "text": "can your personality be detached from your relationships? in the past i would say yes. eventually i realized that was naive & self-centered – people around me change my values & behavior a lot more than i’d like to admit"
  },
  {
    "id": "1504134b-a0a6-44b4-9435-d4da121adbaa",
    "created_time": "2023-05-07T15:23:00.000Z",
    "last_edited_time": "2023-05-12T14:49:00.000Z",
    "text": "emojis are such a dopamine hit"
  },
  {
    "id": "852f3efc-6cb2-4bda-9d1b-a8244874356b",
    "created_time": "2023-05-12T19:37:00.000Z",
    "last_edited_time": "2023-05-14T17:03:00.000Z",
    "text": "a good mindset shift is to define yourself inside out vs outside in. defining yourself by that you bring into the world, rather than what you take from it. a creation mindset – you are defined by what you create, not what you make use of"
  },
  {
    "id": "fe300fff-306c-47be-bd3f-ae49af0c5466",
    "created_time": "2023-05-14T17:02:00.000Z",
    "last_edited_time": "2023-05-14T17:03:00.000Z",
    "text": "alcohol is a negative trade-off. every time"
  },
  {
    "id": "80af441c-7056-49a1-a1bc-116bc7e7b5d9",
    "created_time": "2023-05-15T23:28:00.000Z",
    "last_edited_time": "2023-05-15T23:42:00.000Z",
    "text": "wondering about a matchmaking app where you match 1:1 with a person learning / curious about a similar subject. a mix of tinder + reddit"
  },
  {
    "id": "087ef36f-a5b8-4491-abe0-ec2185bcf19e",
    "created_time": "2023-05-17T11:40:00.000Z",
    "last_edited_time": "2023-05-17T11:46:00.000Z",
    "text": "burnout is often associated with working too much. i think the real reason it happens is because you have defined yourself by what you produce. it’s not just the exertion of energy spent during your working hours, but the exertion of thought spent during the time you’re not working"
  },
  {
    "id": "d9301e97-f1f8-4710-ae10-cae192a6ec0f",
    "created_time": "2023-05-17T21:42:00.000Z",
    "last_edited_time": "2023-05-17T21:43:00.000Z",
    "text": "humans should be more sexual and less sexualized"
  },
  {
    "id": "e59a7579-c72e-45ee-a488-9a09816fd398",
    "created_time": "2023-05-17T21:47:00.000Z",
    "last_edited_time": "2023-05-17T22:18:00.000Z",
    "text": "sometimes I wonder if value-for-value was the main pricing model. i.e. pay what you want – buyer sets the price instead of seller. if the value is created through the lens of the customer – would this push businesses to offer better products & services? it’s also really common for a buyer to overrate the value of something right after experiencing it, or using it for the first time. this means profit for the seller – win-win situation"
  },
  {
    "id": "efc10b02-3d7c-4820-b338-13ab2f885734",
    "created_time": "2023-05-21T11:40:00.000Z",
    "last_edited_time": "2023-05-22T23:42:00.000Z",
    "text": "folder-based structures are possibly the most inefficient way to organize digital knowledge. expensive to navigate, as you need to go through each & every layer. risk of duplication, as a file can exist in multiple folders with no global visibility. mentally taxing to work out when working with other people – everyone conceptualizes information layers differently. flat structures may seem chaotic at first, but they’re the way to go. auto-generated keywords & taxonomies can help fast discovery, and provide a passive way to organize knowledge with little active input required. only input needed is a search query – everything else works behind the scenes. a robust, well-implemented search will beat folder-based structures any day of the week"
  },
  {
    "id": "9e165b08-e3f5-413c-9e98-3ee0404ece99",
    "created_time": "2023-05-22T23:42:00.000Z",
    "last_edited_time": "2023-05-22T23:53:00.000Z",
    "text": "accept things you can’t change. take action when you can change things"
  },
  {
    "id": "9bee58ff-3beb-407a-b0bd-1ec405cbaaa4",
    "created_time": "2023-05-24T13:03:00.000Z",
    "last_edited_time": "2023-05-24T13:39:00.000Z",
    "text": "having a maximalist lifestyle (more is more) ultimately limits you from achieving mindful states"
  },
  {
    "id": "4b24540f-f9b3-434b-9765-3cac0002cd5a",
    "created_time": "2023-05-25T14:03:00.000Z",
    "last_edited_time": "2023-05-25T14:17:00.000Z",
    "text": "biggest pain point in diagramming is worrying about low-level, visual design decisions. i propose a diagramming tool that is extremely opinionated about these decisions. prevent me from spending useless time arranging nodes & connections, layout, spacing, sizing. every element falls into a predefined grid. user interaction is minimal – add, edit, delete. no pixel pushing allowed. this is the only way to make the user employ conceptual, high-level thinking"
  },
  {
    "id": "37ad9dee-d99b-493e-9b5d-a618bfb298d7",
    "created_time": "2023-05-25T14:20:00.000Z",
    "last_edited_time": "2023-05-25T14:22:00.000Z",
    "text": "LLM’s are proof the web is the most impactful modern invention"
  },
  {
    "id": "5884cc9d-46c2-4666-9063-a3eb1ad6b14b",
    "created_time": "2023-05-27T09:27:00.000Z",
    "last_edited_time": "2023-05-27T17:13:00.000Z",
    "text": "achieving brevity is a sign of clarity – you absorbed inputs, condensed them into single, manageable chunks of information, and produced short, concrete outputs"
  },
  {
    "id": "4b706989-e0b1-466a-a5fe-143294f40240",
    "created_time": "2023-05-27T17:02:00.000Z",
    "last_edited_time": "2023-05-27T17:14:00.000Z",
    "text": "best part of being human is how we are able to feel. our sensory experience – sight, sound, scent, taste, touch. specially, the way we construct meaning out of the senses. and how endless in exploration they are"
  },
  {
    "id": "624e715d-736e-4785-a2f1-a7fe5b66854b",
    "created_time": "2023-05-28T23:04:00.000Z",
    "last_edited_time": "2023-05-29T18:43:00.000Z",
    "text": "i’ve started to notice a lot of what i do is rooted on social validation. i don’t create for myself. i create for likes, shares, interactions. on one side, i’m happy to express my creativity in a social environment. i enjoy sharing my work in public looking at. on another, i feel the need to cut down on social dopamine – easy to get lost in the feedback and forget your motivation"
  },
  {
    "id": "2a0f08d4-ca8d-4cc4-a99e-ee00270bcefd",
    "created_time": "2023-05-31T20:18:00.000Z",
    "last_edited_time": "2023-05-31T20:27:00.000Z",
    "text": "you’re never going to revisit those bookmarks. you’re never going to watch those videos later. you’re never going to read that reading list. we hoard text and convince ourselves that it will be useful. someday. sometime. reality, it never happens"
  },
  {
    "id": "a4cecafe-2f63-4cb6-8875-d1fcf25c5897",
    "created_time": "2023-06-02T11:12:00.000Z",
    "last_edited_time": "2023-06-04T00:14:00.000Z",
    "text": "i feel like talking about low-level, technical details is often (unfairly) frowned upon. mainly because high-level knowledge is considered more valuable – indicative that you have a holistic & clear overview of a thing. high-level knowledge, however, is not tangible. and alone, by itself, does not produce output. it is not an executable"
  },
  {
    "id": "9b202743-c64a-40dd-ac3c-26a8df308544",
    "created_time": "2023-06-04T00:09:00.000Z",
    "last_edited_time": "2023-06-06T23:01:00.000Z",
    "text": "being highly sociable is life’s cheat code. a big shortcut to success. but right now i’m refusing to take shortcuts. and that's a big mistake"
  },
  {
    "id": "b16ff279-8866-47ec-aed2-90e0b7bda671",
    "created_time": "2023-06-07T13:13:00.000Z",
    "last_edited_time": "2023-06-07T13:16:00.000Z",
    "text": "cables give me anxiety. on a complete disregard for basic physics, wish electricity could just float in the air and charge things around you. connect to energy like connecting to bluetooth or wifi"
  },
  {
    "id": "5311440c-ff16-406f-8628-51d9363709f9",
    "created_time": "2023-06-08T01:44:00.000Z",
    "last_edited_time": "2023-06-08T01:46:00.000Z",
    "text": "in a life stage of wanting things I don’t need, and needing things I don’t want"
  },
  {
    "id": "0097a2c5-a6e1-476e-9a98-93339ea78238",
    "created_time": "2023-06-08T11:06:00.000Z",
    "last_edited_time": "2023-06-09T01:04:00.000Z",
    "text": "i’ve just intellectualized colocation: the practice of keeping related items together based on their conceptual value. it applies both to the physical & digital world, and makes everything much more surfaceable – connected things become easy to find, use & manage. it also maps extremely well to how our brain works – a graph of related thoughts based on conceptual value"
  },
  {
    "id": "7c90d498-8ea8-451f-8930-6475d69a961d",
    "created_time": "2023-06-08T13:56:00.000Z",
    "last_edited_time": "2023-06-11T17:42:00.000Z",
    "text": "great software makes simple things easy and complex things possible"
  },
  {
    "id": "32bc3bf1-ca81-4fa4-8d79-fa806985def4",
    "created_time": "2023-06-11T17:34:00.000Z",
    "last_edited_time": "2023-06-11T17:42:00.000Z",
    "text": "ads have a conflicting nature. they target those who don't pay for premium products/services (which typically exclude ads). this means that companies using ads are mainly reaching low-income, price-sensitive individuals. ideally, companies would want to advertise their products to people with financial power to buy. essentially, the opposite type of consumer. it’s a contradiction"
  },
  {
    "id": "3a8fdff9-e449-407a-bb10-bb7fd34e139a",
    "created_time": "2023-06-13T20:08:00.000Z",
    "last_edited_time": "2023-06-15T23:02:00.000Z",
    "text": "reminder to be the one making the (seemingly) stupid questions. so much effort made pointless when you miss the primitives – what is this, why are we doing this, how is this done. difficult for the ego. but crucial to do things right"
  },
  {
    "id": "95fc55f8-53c9-4066-a66a-893508ff5385",
    "created_time": "2023-06-13T23:42:00.000Z",
    "last_edited_time": "2023-06-15T23:02:00.000Z",
    "text": "incremental change is the only effective change. trying to change too much, or too fast – doesn’t work"
  },
  {
    "id": "24ce1366-b146-4950-a1c1-304c993e1dab",
    "created_time": "2023-06-15T23:03:00.000Z",
    "last_edited_time": "2023-06-15T23:11:00.000Z",
    "text": "increasing reward can be more effective than reducing friction. tracking my runs made me realize this. ever since i got on Strava, i desperately want to hit the road again to beat my best time. the act of getting out and going for a run is the same – no friction reduced. however my reward system really enjoys watching the stats and keeping the streak"
  },
  {
    "id": "a230b652-1410-4067-96d5-708567135530",
    "created_time": "2023-06-17T00:31:00.000Z",
    "last_edited_time": "2023-06-18T17:50:00.000Z",
    "text": "optimal social group setting size is 6. just the right amount to have multiple (2 or 3) parallel conversations that you can easily transition between. still possible to 1:1 with everyone. not too draining on your social battery "
  },
  {
    "id": "a873730c-bc67-499a-a9ee-9362621c2f82",
    "created_time": "2023-06-18T17:45:00.000Z",
    "last_edited_time": "2023-06-22T20:36:00.000Z",
    "text": "kinda cool how we can give human-like personality to machines through I/O behavior. fast I/O – energetic, impatient. slow I/O – calm, easy-going"
  },
  {
    "id": "4faad7b5-98e7-4c83-9b8d-2681ba30413d",
    "created_time": "2023-06-22T20:38:00.000Z",
    "last_edited_time": "2023-06-27T22:27:00.000Z",
    "text": "being capable of detaching reaction from event. so important. every experience you go through is an opportunity for growth – it all depends on the psychological frame you create around it. someone criticized you? missed a deadline? failed a task? think before you react. control your response. gain perspective on your emotions"
  },
  {
    "id": "24c5d043-9384-477a-8b17-52955a902c85",
    "created_time": "2023-06-27T22:27:00.000Z",
    "last_edited_time": "2023-06-27T22:29:00.000Z",
    "text": "everything in life is derived from our senses. senses are the human primitives. my goal is to explore them as deeply as I can"
  },
  {
    "id": "4f38eff5-b122-43c3-a830-92da43c23924",
    "created_time": "2023-06-25T14:04:00.000Z",
    "last_edited_time": "2023-06-27T22:27:00.000Z",
    "text": "customization is a losing game. it might feel good to tailor something to your own specific needs & preferences. however, every customization is a step away from common ground. with every customization, you get increasingly trapped into your own context – you lose the ability to be relatable. sticking to defaults is often the best choice. having a self-restraint posture towards customization is healthy"
  },
  {
    "id": "403a9c23-e533-41a5-b197-b7cd7fae30e4",
    "created_time": "2023-06-25T20:53:00.000Z",
    "last_edited_time": "2023-06-27T22:17:00.000Z",
    "text": "the shift to short & fast-paced text might have reduced our attention spans. but it definitely made text creators better at synthesizing information – focusing on the essential and cutting the extra"
  },
  {
    "id": "4adab8af-a5a9-4e86-b07a-bebd1cb193a1",
    "created_time": "2023-06-27T21:53:00.000Z",
    "last_edited_time": "2023-06-27T21:55:00.000Z",
    "text": "most important phase of knowledge acquisition is reflection. no matter how much information you cram into your brain – if you don’t stop to reflect, you don’t learn"
  },
  {
    "id": "19525e75-5055-41e7-ad0b-7b90f65ee0ac",
    "created_time": "2023-06-27T21:56:00.000Z",
    "last_edited_time": "2023-06-28T13:13:00.000Z",
    "text": "the world only lacks novelty if you lack curiosity"
  },
  {
    "id": "81fcfba4-81bb-4e49-bde0-5d884a5237cc",
    "created_time": "2023-07-02T22:24:00.000Z",
    "last_edited_time": "2023-07-05T21:43:00.000Z",
    "text": "it’s not enough for something (software, hardware) to work well. it needs to work reliably well. most products shine on optimal circumstances, and fail miserably on edge cases. reliability is covering those edge cases. make it work everytime"
  },
  {
    "id": "b02e39b3-16a1-48bb-b676-2f30e467c424",
    "created_time": "2023-07-05T21:43:00.000Z",
    "last_edited_time": "2023-07-05T21:44:00.000Z",
    "text": "if you avoid being too abstract or too specific – you achieve meaning"
  },
  {
    "id": "ba33059a-c63a-439e-b363-0b8a43cd2d78",
    "created_time": "2023-07-05T21:42:00.000Z",
    "last_edited_time": "2023-07-06T19:16:00.000Z",
    "text": "real technological progress lowers the bar and raises the ceiling"
  },
  {
    "id": "7d48bbc9-4613-4c12-ba48-8c8e987517f9",
    "created_time": "2023-07-06T19:11:00.000Z",
    "last_edited_time": "2023-07-06T22:50:00.000Z",
    "text": "doing what everyone does is generally a good decision"
  }
]
